function y = h_KR(x,AF_F,af_order,p,n,interv)

% h_KR(x,AF_F,af_order,p,n,interv)
% ÑÎÏĞßÆÅÍÍÛÉ ÇÅĞÊÀËÜÍÛÉ ÏÑÅÂÄÎÔÈËÜÒĞ ÂÅÉÂËÅÒÎÂ ÊĞÀÂ×ÅÍÊÎ-ĞÂÀ×ÅÂÀ
% ÒÎËÜÊÎ ÄËß ÔÈËÜÒĞÎÂ Ñ ×ÅÒÍÎÉ (ÈËÈ ÍÓËÅÂÎÉ) ĞÅÀËÜÍÎÉ ×ÀÑÒÜŞ ÔÓĞÜÅ-ÑÏÅÊÒĞÀ
% È ÍÅ×ÅÒÍÎÉ (ÈËÈ ÍÓËÅÂÎÉ) ÊÎÌÏËÅÊÑÍÎÉ 
%
% x - ÀĞÃÓÌÅÍÒ
% AF_F - ÑÑÛËÊÀ ÍÀ ÑÏÅÊÒĞ ÀÒÎÌÀĞÍÎÉ ÔÓÍÊÖÈÈ
% af_order - ÏÎĞßÄÎÊ ÀÒÎÌÀĞÍÎÉ ÔÓÍÊÖÈÈ
% p - ÏÎĞßÄÎÊ ÂÅÉÂËÅÒÀ (ÑÒÅÏÅÍÜ ÌÍÎÆÈÒÅËß (cos(om/2))^p)    
% p ÄÎËÆÍÎ ÁÛÒÜ ÏÎËÎÆÈÒÅËÜÍÛÌ ÖÅËÛÌ ×ÈÑËÎÌ
% n - ÒÎ×ÍÎÑÒÜ (ÊÎËÈ×ÅÑÒÂÎ ×ËÅÍÎÂ ĞÀÇËÎÆÅÍÈß ÄËß ÂÛ×ÈÑËÅÍÈß ÔÓÍÊÖÈÈ - ÏÎ ÓÌÎË×ÀÍÈŞ 50)     
% n ÄÎËÆÍÎ ÁÛÒÜ ÏÎËÎÆÈÒÅËÜÍÛÌ ÖÅËÛÌ ×ÈÑËÎÌ
% interv - ÈÍÒÅĞÂÀË ÂÛ×ÈÑËÅÍÈß ÔÓÍÊÖÈÈ ×ÅĞÅÇ ÅÅ ĞßÄ ÔÓĞÜÅ [-interv, interv]
%
% (Ñ) ÊÎØÅËÅÂ ÀÍÄĞÅÉ 26.08.06
%

% ÇÍÀ×ÅÍÈÅ n ÏÎ ÓÌÎË×ÀÍÈŞ
if nargin == 4
    n=50;
end

% ÏĞÎÂÅĞÊÀ ÍÀ ÏÎËÎÆÈÒÅËÜÍÎÑÒÜ È ÑÊÀËßĞÍÎÑÒÜ n
if ((numel(n) > 1) || (n < 0))
    error('n must be a positive scalar!');
end

% ÏĞÎÂÅĞßÅÌ ×ÒÎ n - ÖÅËÎÅ
if(mod(n,floor(n))~=0)
    error('n must be an integer!');
end

% ÂÛ×ÈÑËÅÍÈÅ ÔÓÍÊÖÈÈ ×ÅĞÅÇ ĞßÄ ÔÓĞÜÅ 
y=0.5*H_om_F(0,AF_F,af_order,p);

if (nargin==6)
    L=interv;
else
    L=max( abs(x(1)), abs(x(end)) ); % ÎÏĞÅÄÅËÅÍÈÅ ÈÍÒÅĞÂÀËÀ ÂÛ×ÈÑËÅÍÈß [-L,L]    
end

for k=1:n    
    y = y + ...
        real(H_om_F(k*pi/L,AF_F,af_order,p)).*cos(pi*k*x/L) - ...
        imag(H_om_F(k*pi/L,AF_F,af_order,p)).*sin(pi*k*x/L);
end

y=y./L;

% h_KR(x)=0 ÂÍÅ ÍÎÑÈÒÅËß [-L,L]
nums=abs(x)>L;
y(nums)=0;