function y = Sc_fun_KR(x,AF_F,af_num,p,n,m,interv)

% Sc_fun_KR(x,AF_F,af_num,p,n,m,interv)
% ÏÑÅÂÄÎÌÀÑØÒÀÁÈĞÓŞÙÈÅ ÔÓÍÊÖÈÈ ÊĞÀÂ×ÅÍÊÎ-ĞÂÀ×ÅÂÀ
% ÒÎËÜÊÎ ÄËß ÔÓÍÊÖÈÉ Ñ ×ÅÒÍÎÉ (ÈËÈ ÍÓËÅÂÎÉ) ĞÅÀËÜÍÎÉ ×ÀÑÒÜŞ ÔÓĞÜÅ-ÑÏÅÊÒĞÀ
% È ÍÅ×ÅÒÍÎÉ (ÈËÈ ÍÓËÅÂÎÉ) ÊÎÌÏËÅÊÑÍÎÉ 
%
% x - ÀĞÃÓÌÅÍÒ
% AF_F - ÑÑÛËÊÀ ÍÀ ÑÏÅÊÒĞ ÀÒÎÌÀĞÍÎÉ ÔÓÍÊÖÈÈ
% af_order - ÏÎĞßÄÎÊ ÀÒÎÌÀĞÍÎÉ ÔÓÍÊÖÈÈ
% p - ÏÎĞßÄÎÊ ÂÅÉÂËÅÒÀ (ÑÒÅÏÅÍÜ ÌÍÎÆÈÒÅËß (cos(om/2))^p)    
% p ÄÎËÆÍÎ ÁÛÒÜ ÏÎËÎÆÈÒÅËÜÍÛÌ ÖÅËÛÌ ×ÈÑËÎÌ
% n - ÒÎ×ÍÎÑÒÜ (ÊÎËÈ×ÅÑÒÂÎ ×ËÅÍÎÂ ÏĞÎÈÇÂÅÄÅÍÈß ÄËß ÂÛ×ÈÑËÅÍÈß 
%               ÑÎÎÒÂÅÒÑÒÂÓŞÙÅÉ ÀÒÎÌÀĞÍÎÉ ÔÓÍÊÖÈÈ - ÏÎ ÓÌÎË×ÀÍÈŞ 50)     
% n ÄÎËÆÍÎ ÁÛÒÜ ÏÎËÎÆÈÒÅËÜÍÛÌ ÖÅËÛÌ ×ÈÑËÎÌ
% m - ÒÎ×ÍÎÑÒÜ (ÊÎËÈ×ÅÑÒÂÎ ×ËÅÍÎÂ ĞÀÇËÎÆÅÍÈß ÄËß ÂÛ×ÈÑËÅÍÈß ÔÓÍÊÖÈÈ - 
%               ÏÎ ÓÌÎË×ÀÍÈŞ 50)     
% m ÄÎËÆÍÎ ÁÛÒÜ ÏÎËÎÆÈÒÅËÜÍÛÌ ÖÅËÛÌ ×ÈÑËÎÌ
% interv - ÈÍÒÅĞÂÀË ÂÛ×ÈÑËÅÍÈß ÔÓÍÊÖÈÈ ×ÅĞÅÇ ÅÅ ĞßÄ ÔÓĞÜÅ [-interv, interv]
%
% (Ñ) ÊÎØÅËÅÂ ÀÍÄĞÅÉ 26.08.06 
%

% ÇÍÀ×ÅÍÈß m è n ÏÎ ÓÌÎË×ÀÍÈŞ
if nargin == 4
    n=50;
    m=50;
end

if nargin == 5
    m=50;
end

% ÏĞÎÂÅĞÊÀ ÍÀ ÏÎËÎÆÈÒÅËÜÍÎÑÒÜ È ÑÊÀËßĞÍÎÑÒÜ m
if ((prod(size(m)) > 1) | (m < 0))
    error('m must be a positive scalar!');
end

% ÏĞÎÂÅĞßÅÌ ×ÒÎ m - ÖÅËÎÅ
if(mod(m,floor(m))~=0)
    error('m must be an integer!');
end

% ÂÛ×ÈÑËÅÍÈÅ ÔÓÍÊÖÈÈ ×ÅĞÅÇ ĞßÄ ÔÓĞÜÅ 
y=0.5*Sc_om_F(0,AF_F,af_num,p,n);

if (nargin==7)
    L=interv;
else
    L=max( abs(x(1)), abs(x(end)) ); % ÎÏĞÅÄÅËÅÍÈß ÈÍÒÅĞÂÀËÀ ÂÛ×ÈÑËÅÍÈß [-L,L]    
end

for k=1:m    
    y=y+real(Sc_om_F(k*pi/L,AF_F,af_num,p,n)).*cos(pi*k*x/L)-imag(Sc_om_F(k*pi/L,AF_F,af_num,p,n)).*sin(pi*k*x/L);
end
y=y./L;

% Sc_fun_KR(x)=0 ÂÍÅ ÍÎÑÈÒÅËß [-L,L]
nums=find(abs(x)>L);
y(nums)=0;


