function y=Sc_om_F(om, AF_F, af_order, p, n)

% Sc_om_F(om, AF_F, af_order, p, n)
% ÑÏÅÊÒÐ ÏÑÅÂÄÎÌÀÑØÒÀÁÈÐÓÞÙÈÕ ÔÓÍÊÖÈÉ ÊÐÀÂ×ÅÍÊÎ-ÐÂÀ×ÅÂÀ
%
% om - ×ÀÑÒÎÒÀ
% AF_F - ÑÑÛËÊÀ ÍÀ ÑÏÅÊÒÐ ÀÒÎÌÀÐÍÎÉ ÔÓÍÊÖÈÈ
% af_order - ÏÎÐßÄÎÊ ÀÒÎÌÀÐÍÎÉ ÔÓÍÊÖÈÈ
% p - ÏÎÐßÄÎÊ ÂÅÉÂËÅÒÀ (ÑÒÅÏÅÍÜ ÌÍÎÆÈÒÅËß (cos(om/2))^p)    
% p ÄÎËÆÍÎ ÁÛÒÜ ÏÎËÎÆÈÒÅËÜÍÛÌ ÖÅËÛÌ ×ÈÑËÎÌ
% n - ÒÎ×ÍÎÑÒÜ (ÊÎËÈ×ÅÑÒÂÎ ×ËÅÍÎÂ ÏÐÎÈÇÂÅÄÅÍÈß ÄËß ÂÛ×ÈÑËÅÍÈß ÔÓÍÊÖÈÈ - ÏÎ ÓÌÎË×ÀÍÈÞ 20)     
% n ÄÎËÆÍÎ ÁÛÒÜ ÏÎËÎÆÈÒÅËÜÍÛÌ ÖÅËÛÌ ×ÈÑËÎÌ
% 
% (Ñ) ÊÎØÅËÅÂ ÀÍÄÐÅÉ 26.08.06
%

% ÇÍÀ×ÅÍÈÅ n ÏÎ ÓÌÎË×ÀÍÈÞ
if nargin == 4
    n=20;
end

% ÏÐÎÂÅÐÊÀ ÍÀ ÏÎËÎÆÈÒÅËÜÍÎÑÒÜ È ÑÊÀËßÐÍÎÑÒÜ n
if ((numel(n) > 1) || (n < 0))
    error('n must be a positive scalar!');
end

% ÏÐÎÂÅÐßÅÌ ×ÒÎ n - ÖÅËÎÅ
if(mod(n,floor(n))~=0)
    error('n must be an integer!');
end

% ÂÛ×ÈÑËÅÍÈÅ ÌÀÑØÒÀÁÈÐÓÞÙÅÉ ÔÓÍÊÖÈÈ
y=1;
for k=1:n
    y=y/sqrt(2).*H_om_F((2^(-k))*om, AF_F, af_order,p);
end
