function y=Wavelet_KR_F(om, AF_F, af_order, p, n)

% Wavelet_KR_F(om, AF_F, af_order, p, n)
% яоейрп беибкернб йпюбвемйн-пбювебю
%
% om - вюярнрю
% AF_F - яяшкйю мю яоейрп юрнлюпмни тсмйжхх
% af_order - онпъднй юрнлюпмни тсмйжхх
% p - онпъднй беибкерю (яреоемэ лмнфхрекъ (cos(om/2))^p)    
% p днкфмн ашрэ онкнфхрекэмшл жекшл вхякнл
% n - рнвмнярэ (йнкхвеярбн вкемнб опнхгбедемхъ дкъ бшвхякемхъ тсмйжхх - он слнквюмхч 20)     
% n днкфмн ашрэ онкнфхрекэмшл жекшл вхякнл
% 
% (я) йньекеб юмдпеи 26.08.06 
%

% гмювемхе n он слнквюмхч
if nargin == 4
    n=20;
end

y = (1/sqrt(2)) * ...
    H_om_F(om/2+pi, AF_F, af_order, p) .* ...
    Sc_om_F(om/2, AF_F, af_order, p, n) .* ...
    exp(-1i*om/2);
