%
% ахакхнрейю юрнлюпмшу тсмйжхи
% (Я) йньекеб юмдпеи 24.09.06
%
%***********************************************
% юрнлюпмше тсмйжхх
%
% up_cos(x,n,m)  - юрнлюпмюъ тсмйжхъ up
% fup_n(x,n,m)   - юрнлюпмюъ тсмйжхъ fup_n
% up_m(x,m,n)    - юрнлюпмюъ тсмйжхъ up_m
% h_a(x,a,m)     - юрнлюпмюъ тсмйжхъ h_a
% eup_a(x, a, n) - юрнлюпмюъ тсмйжхъ eup_a(x)
% hup_a(x,a,m)   - юрнлюпмюъ тсмйжхъ hup_a(x)
% scup_a(x,a,m)  - юрнлюпмюъ тсмйжхъ scup_a(x)
%
%***********************************************
% опенапюгнбюмхъ тспэе юрнлюпмшу тсмйжхи
% 
% UP_F(om, m)        - яоейрп юрнлюпмни тсмйжхх up(x)
% H_a_F(om, a, m)    - яоейрп юрнлюпмни тсмйжхх h_a(x)
% UP_m_F(om, m, n)   - яоейрп юрнлюпмни тсмйжхх up_m(x)
% FUP_n_F(om, n, m)  - яоейрп юрнлюпмни тсмйжхх fup_n(x)
% EUP_a_F(om, a, n)  - яоейрп юрнлюпмни тсмйжхх eup_a(x)
% HUP_a_F(om, a, n)  - яоейрп юрнлюпмни тсмйжхх hup_a(x)
% TUP_a_F(om, a, n)  - яоейрп юрнлюпмни тсмйжхх tup_a(x)
% SCUP_a_F(om, a, n) - яоейрп юрнлюпмни тсмйжхх scup_a(x)
%
%***********************************************
%
% supp_af(af_fun, af_order) - нопедекемхе мняхрекъ гюдюммни ют 
% af_norm(af_fun, af_order) - бшвхякемхе L2-мнплш ют
%