function y = UP_F(om, m)

% UP_F(om, m)
% ÑÏÅÊÒÐ ÀÒÎÌÀÐÍÎÉ ÔÓÍÊÖÈÈ up(x)
%
% m - ÊÎËÈ×ÅÑÒÂÎ ÓÄÅÐÆÈÂÀÅÌÛÕ ×ËÅÍÎÂ ÏÐÈ ÂÛ×ÈÑËÅÍÈÈ ÁÅÑÊÎÍÅ×ÍÎÃÎ ÏÐÎÈÇÂÅÄÅÍÈß (ïî óìîë÷àíèþ 50)    
% m ÄÎËÆÍÎ ÁÛÒÜ ÏÎËÎÆÈÒÅËÜÍÛÌ ÖÅËÛÌ ×ÈÑËÎÌ
%
% (Ñ) ÊÎØÅËÅÂ ÀÍÄÐÅÉ 17.03.06 15:40

% ÇÍÀ×ÅÍÈÅ m ÏÎ ÓÌÎË×ÀÍÈÞ
if nargin == 1
    m=50;
end

% ÏÐÎÂÅÐÊÀ ÍÀ ÏÎËÎÆÈÒÅËÜÍÎÑÒÜ È ÑÊÀËßÐÍÎÑÒÜ m
if ((prod(size(m)) > 1) | (m < 0))
    error('m must be a positive scalar!');
end

% ÏÐÎÂÅÐßÅÌ ×ÒÎ m - ÖÅËÎÅ
if(mod(m,floor(m))~=0)
    error('m must be integer!');
end

n=find(om==0);
om(n)=1;

y=1;
for k=1:m
    y=y.*sin(om*2^(-k))./(om*2^(-k));
end

y(n)=1;


    
        