function y = koef_c(n)

% ÂÑÏÎÌÎÃÀÒÅËÜÍÀß ÏÐÎÖÅÄÓÐÀ ÂÛ×ÈÑËÅÍÈß 
% ÊÎÝÔÔÈÖÈÅÍÒÎÂ c, ÈÑÏÎËÜÇÓÞÙÈÕÑß ÏÐÈ
% ÂÛ×ÈÑËÅÍÈÈ ÌÎÌÅÍÒÎÂ ÀÒÎÌÀÐÍÎÉ ÔÓÍÊÖÈÈ up(x)
%
% n - ÍÎÌÅÐ ÊÎÝÔÔÈÖÈÅÍÒÀ c
% n ÄÎËÆÍÎ ÁÛÒÜ ×ÅÒÍÛÌ ÏÎËÎÆÈÒÅËÜÍÛÌ ×ÈÑËÎÌ
%
% (Ñ) ÊÎØÅËÅÂ ÀÍÄÐÅÉ 30.09.05 21:15


% ÏÐÎÂÅÐÊÀ ÍÀ ÏÎËÎÆÈÒÅËÜÍÎÑÒÜ È ÑÊÀËßÐÍÎÑÒÜ
if ((prod(size(n)) > 1) | (n < 0))
    error('n must be a positive scalar!');
end

% ÏÐÎÂÅÐßÅÌ ×ÒÎ n ÖÅËÎÅ È ×ÅÒÍÎÅ
if(mod(n,2)~=0)
    error('n must be even!');
end

if (n==0)
    % Â ÑËÓ×ÀÅ n=0 ÐÅÇÓËÜÒÀÒ =1
    y=1;
else
    % Â ÑËÓ×ÀÅ n~=0 ÊÎÝÔÔÈÖÈÅÍÒÛ c ÂÛ×ÈÑËßÞÒÑß ÐÅÊÓÐÑÈÂÍÎ
    
    % ÏÅÐÅÕÎÄ ÎÒ 2n Ê ÐÅÀËÜÍÎÌÓ n
    n=n/2; 
    
    sum=0;
    for j=0:n-1
        sum=sum+(-1)^(n-j)*koef_c(2*j)/factorial(2*n-2*j+1);
    end
    y=1/(4^n-1)*sum;
end

